stm32-hotspot/STM32WB0-BLE-PAwR-ESL/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_ESL_AP/STM32_BLE/App/app_ble.c
      status = aci_gap_start_procedure (GAP_GENERAL_DISCOVERY_PROC,LE_1M_PHY_BIT,0,0);
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("aci_gap_start_procedure - fail, result: 0x%02X\n", status);
      }
      else
      {
        bleAppContext.Device_Connection_Status = (APP_BLE_ConnStatus_t)paramC;
        APP_DBG_MSG("==>> aci_gap_start_procedure - Success\n");
      }
      break;
    }/* PROC_GAP_CENTRAL_SCAN_START */
    case PROC_GAP_CENTRAL_SCAN_TERMINATE:
    {
      status = aci_gap_terminate_proc(GAP_GENERAL_DISCOVERY_PROC);
      if (status != BLE_STATUS_SUCCESS)
      {
        APP_DBG_MSG("aci_gap_terminate_gap_proc - fail, result: 0x%02X\n",status);
      }
      else
      {
        bleAppContext.Device_Connection_Status = (APP_BLE_ConnStatus_t)paramC;
        APP_DBG_MSG("==>> aci_gap_terminate_gap_proc - Success\n");
      }
      break;
    }/* PROC_GAP_CENTRAL_SCAN_TERMINATE */

    default:
      break;
  }
  return;
}

static void gap_cmd_resp_release(void)
{
  UTIL_SEQ_SetEvt(1 << CFG_IDLEEVT_PROC_GAP_COMPLETE);
  return;
}

static void gap_cmd_resp_wait(void)
{
  UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_PROC_GAP_COMPLETE);
  return;
}
/* USER CODE BEGIN FD_LOCAL_FUNCTION */

static void start_periodic_adv(void)
{
  tBleStatus status;
  Advertising_Set_Parameters_t advertising_set_parameters;
  
  status = aci_gap_set_advertising_configuration(0, 
                                                 GAP_MODE_NON_DISCOVERABLE,
                                                 HCI_ADV_EVENT_PROP_NONE,
                                                 1600, 
                                                 1600,
                                                 HCI_ADV_CH_ALL,
                                                 0,
                                                 NULL, /* No peer address */
                                                 HCI_ADV_FILTER_NONE,
                                                 0, /* 0 dBm */
                                                 HCI_PHY_LE_1M, /* Primary advertising PHY */
                                                 0, /* 0 skips */
                                                 HCI_PHY_LE_1M, /* Secondary advertising PHY. Not used with legacy advertising. */
                                                 0, /* SID */
                                                 0 /* No scan request notifications */);
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("==>> aci_gap_set_advertising_configuration - fail, result: 0x%02X\n", status);
  }
  else
  {
    APP_DBG_MSG("==>> Success: aci_gap_set_advertising_configuration\n");
  }
  
  status = hci_le_set_periodic_advertising_parameters_v2(0,
                                                         (PAWR_INTERVAL_MS*100)/125,
                                                         (PAWR_INTERVAL_MS*100)/125,
                                                         0,
                                                         PAWR_NUM_SUBEVENTS,
                                                         (PAWR_SUBEVENT_INTERVAL_MS*100)/125,
                                                         (PAWR_RESPONSE_SLOT_DELAY_MS*100)/125,
                                                         PAWR_RESPONSE_SLOT_SPACING_US/125,
                                                         PAWR_NUM_RESPONSE_SLOTS);
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("==>> hci_le_set_periodic_advertising_parameters_v2 - fail, result: 0x%02X\n", status);
  }
  else
  {
    APP_DBG_MSG("==>> Success: hci_le_set_periodic_advertising_parameters_v2\n");
  }
  
  status = hci_le_set_periodic_advertising_enable(HCI_ENABLE, 0);
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("==>> hci_le_set_periodic_advertising_enable - fail, result: 0x%02X\n", status);
  }
  else
  {
    APP_DBG_MSG("==>> Success: hci_le_set_periodic_advertising_enable\n");
  }
  
  advertising_set_parameters.Advertising_Handle = 0;
  advertising_set_parameters.Duration = 0;
  advertising_set_parameters.Max_Extended_Advertising_Events = 0;
  
  status = hci_le_set_extended_advertising_enable(HCI_ENABLE, 1, &advertising_set_parameters);
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("==>> hci_le_set_extended_advertising_enable - fail, result: 0x%02X\n", status);
  }
  else
  {
    APP_DBG_MSG("==>> Success: hci_le_set_extended_advertising_enable\n");
  }
  
  status = hci_le_set_extended_advertising_enable(HCI_DISABLE, 1, &advertising_set_parameters); 
  
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("==>> hci_le_set_extended_advertising_enable - fail, result: 0x%02X\n", status);
  }
}

static void start_auto_connection(void)
{
  tBleStatus status;
  
  status = aci_gap_add_devices_to_filter_accept_and_resolving_list(1, 1, sizeof(esl_devices)/sizeof(List_Entry_t), esl_devices);
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("aci_gap_add_devices_to_filter_accept_and_resolving_list - fail, result: 0x%02X\n", status);
    Error_Handler();
  }
  else
  {
    
    APP_DBG_MSG("==>> aci_gap_add_devices_to_filter_accept_and_resolving_list - Success\n");
  }
  
  status = aci_gap_set_scan_configuration(DUPLICATE_FILTER_ENABLED, HCI_SCAN_FILTER_BASIC_FILTERED, LE_1M_PHY_BIT, HCI_SCAN_TYPE_PASSIVE, (SCAN_INTERVAL_MS*1000)/625, (SCAN_WINDOW_MS*1000)/625);
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("aci_gap_set_scan_configuration - fail, result: 0x%02X\n", status);
    Error_Handler();
  }
  else
  {
    APP_DBG_MSG("==>> aci_gap_set_scan_configuration - Success\n");
  }
  
  status = aci_gap_set_connection_configuration(LE_1M_PHY_BIT,
                                                (CONNECTION_INTERVAL_MS*100)/125, (CONNECTION_INTERVAL_MS*100)/125,
                                                0u,
                                                SUPERVISION_TIMEOUT_MS/10,
                                                2, 2);  
  if (status == BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("==>> aci_gap_set_connection_configuration Success , result: 0x%02x\n", status);
  }
  else
  {
    APP_DBG_MSG("==>> aci_gap_set_connection_configuration Failed , result: 0x%02x\n", status);
    Error_Handler();
  } 
  
  status = aci_gap_start_procedure(GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC, LE_1M_PHY_BIT, 0, 0);
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("aci_gap_start_procedure - fail, result: 0x%02X\n", status);
    bleAppContext.Device_Connection_Status = APP_BLE_IDLE;
    Error_Handler();
  }
  else
  {
    APP_DBG_MSG("==>> aci_gap_start_procedure (auto connection) - Success\n");
    bleAppContext.Device_Connection_Status = APP_BLE_LP_CONNECTING;
  }  
}

/* Task for CFG_TASK_START_INFO_TRANSFER */
void periodic_sync_info_transfer(void)
{
  tBleStatus status;
  
  status = hci_le_periodic_advertising_set_info_transfer(bleAppContext.BleApplicationContext_legacy.connectionHandle, 0, 0); 
  if (status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("hci_le_periodic_advertising_set_info_transfer - fail, result: 0x%02X, conn handle: 0x%04X\n", status, bleAppContext.BleApplicationContext_legacy.connectionHandle);
    return;
  }
  else
  {
    APP_DBG_MSG("==>> hci_le_periodic_advertising_set_info_transfer - Success\n");
  }
}

void connection_setup(void)
{
   tBleStatus ret;
   
   UTIL_SEQ_ClrEvt(1 << CFG_IDLEEVT_READ_REMOTE_FEATURES_COMPLETE);
   ret = hci_le_read_remote_features(bleAppContext.BleApplicationContext_legacy.connectionHandle);
   APP_DBG_MSG("hci_le_read_remote_features - result: 0x%02X\n", ret);
   if (ret == BLE_ERROR_CONTROLLER_BUSY)
   {
     /* Retry later */
     UTIL_SEQ_SetTask( 1U << CFG_TASK_CONN_SETUP, CFG_SEQ_PRIO_0);
     
     return;
   }
   else if(ret != BLE_STATUS_SUCCESS)
   {
     APP_BLE_Procedure_Gap_General(PROC_GAP_GEN_CONN_TERMINATE);
     
     return;
   }   
   
   UTIL_SEQ_WaitEvt(1 << CFG_IDLEEVT_READ_REMOTE_FEATURES_COMPLETE);
   //TODO: check if remote device has wanted feature
   
   ret = aci_gap_set_security(bleAppContext.BleApplicationContext_legacy.connectionHandle, GAP_SECURITY_LEVEL_2, 0x00);
   if (ret != BLE_STATUS_SUCCESS)
   {
     APP_DBG_MSG("Pairing request cmd failure: 0x%02X\n", ret);
   }
   else
   {
     APP_DBG_MSG("Pairing request cmd success\n");
     
