stm32-hotspot/STM32WB0-BLE-PAwR-ESL/Projects/NUCLEO-WB09KE/Applications/BLE/BLE_ESL_AP/STM32_BLE/App/app_ble.c
   }
}

void create_periodic_advertising_connection(uint8_t subevent, uint8_t Peer_Address[6], uint8_t Peer_Address_Type)
{ 
    tBleStatus ble_status;
    APP_DBG_MSG("!!!!! create_periodic_advertising_connection \n Peer_Address @:%02x:%02x:%02x:%02x:%02x:%02x\n",
               Peer_Address[5],
               Peer_Address[4],
               Peer_Address[3],
               Peer_Address[2],
               Peer_Address[1],
               Peer_Address[0]);
    APP_DBG_MSG("      Connection Interval:   %d ms\n  - Supervision Timeout: %d ms\n",
               ((CONNECTION_INTERVAL_MS*100)/125), 
               (SUPERVISION_TIMEOUT_MS/10) );
    
    aci_gap_terminate_proc(GAP_AUTO_CONNECTION_ESTABLISHMENT_PROC);
    gap_cmd_resp_wait();
    
    ble_status = aci_gap_create_periodic_advertising_connection(0, 
                                                                subevent,
                                                                0x00,
                                                                0,
                                                                Peer_Address_Type,
                                                                Peer_Address,
                                                                (CONNECTION_INTERVAL_MS*100)/125, (CONNECTION_INTERVAL_MS*100)/125,
                                                                0,
                                                                SUPERVISION_TIMEOUT_MS/10,
                                                                2, 
                                                                2);  
  if (ble_status != BLE_STATUS_SUCCESS)
  {
    APP_DBG_MSG("aci_gap_create_periodic_advertising_connection - fail, result: 0x%02X\n", ble_status);
    return;
  }
  else
  {
    APP_DBG_MSG("==>> aci_gap_create_periodic_advertising_connection - Success\n");
  }    
  bleAppContext.Device_Connection_Status = APP_BLE_LP_CONNECTING;
}     

void set_AP_Status(ESL_AP_status_t status)
{
  bleAppContext.AP_status = status;
}

ESL_AP_status_t get_AP_Status(void)
{
  return bleAppContext.AP_status;
}

/* USER CODE END FD_LOCAL_FUNCTION */

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */

#if (CFG_BUTTON_SUPPORTED == 1)
void APPE_Button1Action(void)
{
  return;
}

void APPE_Button2Action(void)
{  
  return;
}

void APPE_Button3Action(void)
{
  return;
}
#endif /* (CFG_BUTTON_SUPPORTED == 1) */
/* USER CODE END FD_WRAP_FUNCTIONS */

/** \endcond
 */
